In [1]:
import numpy as np
import pandas as pd

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range(
    '20170101', periods=6), columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2017-01-01  0.313328 -1.276823  0.729587  0.261937
2017-01-02 -0.178480  0.434862 -1.321998  0.838595
2017-01-03  0.564775 -1.534320 -2.004906 -1.194903
2017-01-04 -2.509599 -0.188955 -1.235443  0.219351
2017-01-05  0.705357 -0.679985  0.812264  0.982388
2017-01-06 -0.977802  0.597190  0.528256  0.508761

In [ ]:
# df.loc['20170101':'20170104'] = np.nan
# df

                   A         B         C         D
2017-01-01       NaN       NaN       NaN       NaN
2017-01-02       NaN       NaN       NaN       NaN
2017-01-03       NaN       NaN       NaN       NaN
2017-01-04       NaN       NaN       NaN       NaN
2017-01-05  0.311934  0.540657 -0.739244 -2.405101
2017-01-06 -0.280126  0.319843  0.589675  2.942478

In [12]:
df[df.B >0]

                   A         B         C         D
2017-01-02 -0.178480  0.434862 -1.321998  0.838595
2017-01-06 -0.977802  0.597190  0.528256  0.508761

In [13]:
df2 = df.copy()
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']
df2

                   A         B         C         D      E
2017-01-01  0.313328 -1.276823  0.729587  0.261937    one
2017-01-02 -0.178480  0.434862 -1.321998  0.838595    two
2017-01-03  0.564775 -1.534320 -2.004906 -1.194903  three
2017-01-04 -2.509599 -0.188955 -1.235443  0.219351   four
2017-01-05  0.705357 -0.679985  0.812264  0.982388   five
2017-01-06 -0.977802  0.597190  0.528256  0.508761    six

In [ ]:
df2[df2['E'].isin(['one', 'three', 'five'])]

                   A         B         C         D      E
2017-01-01  0.313328 -1.276823  0.729587  0.261937    one
2017-01-03  0.564775 -1.534320 -2.004906 -1.194903  three
2017-01-05  0.705357 -0.679985  0.812264  0.982388   five

In [ ]:
df = pd.DataFrame(np.random.randn(6, 5), columns=list('ABCDE'))

In [19]:
df

          A         B         C         D         E
0 -0.575180  1.181592 -0.186584 -0.727841 -2.221055
1 -1.532179 -1.683521  1.606947  0.394977 -1.525843
2 -0.122791 -0.826456  0.293938  0.314650 -0.147639
3  0.814874  0.448803  0.143821  0.760860 -0.467399
4  1.152199  0.688724  1.338824 -0.597812 -0.253964
5  0.951131 -0.235788 -1.705809 -0.990844  0.037171

In [26]:
df = pd.DataFrame(np.random.randn(6, 5), columns=list('ABCDE'))
pd.concat([df, df], axis=0)

          A         B         C         D         E
0 -0.123062  2.167511  0.157425 -0.322660 -1.080927
1 -0.738447 -0.166202  0.033511 -1.956199 -0.169836
2 -0.631412 -2.180315  0.789148 -0.545027  0.716217
3 -0.011535  0.296316 -0.403005  0.549409 -0.900645
4  0.328163 -0.733753  0.972700 -1.279358  0.511799
5  1.592617  0.900653  1.107226 -1.343551  0.764320
0 -0.123062  2.167511  0.157425 -0.322660 -1.080927
1 -0.738447 -0.166202  0.033511 -1.956199 -0.169836
2 -0.631412 -2.180315  0.789148 -0.545027  0.716217
3 -0.011535  0.296316 -0.403005  0.549409 -0.900645
4  0.328163 -0.733753  0.972700 -1.279358  0.511799
5  1.592617  0.900653  1.107226 -1.343551  0.764320

In [27]:
s = df.iloc[0]
s

A   -0.123062
B    2.167511
C    0.157425
D   -0.322660
E   -1.080927
Name: 0, dtype: float64

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(6, 5), columns=list('ABCDE'))
s = df.iloc[0]
# pd.concat([df, pd.DataFrame(s).T], ignore_index=True)
pd.concat([df, pd.DataFrame([s])], ignore_index=True)

          A         B         C         D         E
0 -0.759123 -0.592908 -1.105954  0.689184 -0.795581
1  0.071350 -0.434245 -1.332342  0.151705  0.011347
2 -0.760516  0.112359  0.918403  0.466011  0.090672
3  0.734695  0.097433  0.494213 -0.751342 -0.467362
4 -0.293191 -1.800893 -0.729481 -0.941453 -1.939457
5 -0.173852  0.508861  1.559652  0.345441  1.684883
6 -0.759123 -0.592908 -1.105954  0.689184 -0.795581

In [37]:
s

A   -1.465270
B   -0.701448
C   -1.030778
D    0.155376
E    1.132749
Name: 0, dtype: float64

In [4]:
data = {
    'Store': ['Tokyo', 'Tokyo', 'Osaka', 'Osaka', 'Tokyo', 'Osaka'],
    'Product': ['Apple', 'Orange', 'Apple', 'Apple', 'Orange', 'Orange'],
    'Sales': [100, 200, 150, 120, 210, 180],
    'Quantity': [1, 5, 2, 2, 4, 3]
}
df = pd.DataFrame(data)
df

   Store Product  Sales  Quantity
0  Tokyo   Apple    100         1
1  Tokyo  Orange    200         5
2  Osaka   Apple    150         2
3  Osaka   Apple    120         2
4  Tokyo  Orange    210         4
5  Osaka  Orange    180         3